# Taps
tap "bloznelis/tap"

# Utilities
brew "bat"
brew "btop"
brew "eza"
brew "gnu-sed"
brew "fzf"
brew "fd"
brew "fastfetch"
brew "onefetch"
brew "yazi"
brew "tealdeer"
brew "ripgrep"
brew "starship"
brew "zoxide"
brew "imagemagick"
brew "stow"
brew "wordgrinder"
brew "micro"
brew "delta"
brew "chafa"
brew "inetutils"
brew "typioca"
brew "ffmpeg"

# Dev
brew "docker-compose"
brew "gh"
brew "hub"
brew "lazygit"
brew "lazydocker"
brew "neovim"
brew "helix"
brew "nvm"
brew "uv"
brew "go"
brew "luarocks"
brew "tmux"
brew "ollama"
brew "aider"
brew "watchman"
brew "posting"
brew "act"
cask "lm-studio"
cask "mockoon"
cask "visual-studio-code"
cask "zed"
cask "kitty"
cask "ghostty"
cask "bruno"

# Apps
cask "discord"
cask "legcord"
cask "docker"
cask "figma"
cask "zen-browser"
cask "google-chrome"
cask "maccy"
cask "rectangle"
cask "spotify"
cask "steam"
cask "whatsapp"
cask "cyberduck"
cask "slack"
cask "raycast"

# Fonts
cask "font-hack"
cask "font-hack-nerd-font"
cask "sf-symbols"

mas "Amphetamine", id: 937984704
